; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v3)
             (pred_6 ?v10 ?v2)
             (pred_3 ?v7 ?v2)
             (pred_12 ?v6 ?v7 )
	     (pred_4 ?v7)
             (pred_5 ?v13)
             (pred_9 ?v10)
             (pred_7 ?v2)
             (pred_8 ?v7)
             (pred_1 ?v10)
             (pred_10 ?v7)
             (pred_2 ))



(:action op_2
:parameters (?v8 ?v5 ?v9 ?v1)
:precondition (and (pred_5 ?v8) (pred_5 ?v5) (pred_9 ?v9) (pred_7 ?v1)
          (pred_11 ?v8 ?v5) (pred_6 ?v9 ?v1)
                   (pred_3 ?v5 ?v1) (pred_4 ?v8) 
                   (pred_8 ?v5) (pred_1 ?v9))
:effect (and  (pred_10 ?v5) (not (pred_8 ?v5))))


(:action op_3
:parameters (?v8 ?v11)
:precondition (and (pred_5 ?v8) (pred_5 ?v11)
               (pred_4 ?v8) (pred_11 ?v8 ?v11) (pred_10 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v8))))

(:action op_1
:parameters (?v8 ?v9)
:precondition (and (pred_5 ?v8) (pred_9 ?v9) 
                  (pred_4 ?v8) (pred_12 ?v9 ?v8) (pred_2 ))
:effect (and (pred_1 ?v9)
   (not (pred_12 ?v9 ?v8)) (not (pred_2 ))))


(:action op_5
:parameters (?v8 ?v4 ?v12)
:precondition (and (pred_5 ?v8) (pred_9 ?v4) (pred_9 ?v12)
                  (pred_4 ?v8) (pred_1 ?v12) (pred_12 ?v4 ?v8))
:effect (and (pred_1 ?v4) (pred_12 ?v12 ?v8)
        (not (pred_1 ?v12)) (not (pred_12 ?v4 ?v8))))

(:action op_4
:parameters (?v8 ?v9)
:precondition (and (pred_5 ?v8) (pred_9 ?v9) 
                  (pred_4 ?v8) (pred_1 ?v9))
:effect (and (pred_2 ) (pred_12 ?v9 ?v8) (not (pred_1 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_20 obj_12 obj_11 obj_15 obj_14 obj_08 obj_05 obj_18 obj_17 obj_03 obj_09 obj_06 obj_02 obj_10 obj_04
    obj_13 obj_19
    obj_01 obj_16
    )

    (:init
       (pred_2)

       (pred_5 obj_07)
       (pred_5 obj_20)
       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_5 obj_18)
       (pred_5 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_09)
       (pred_5 obj_06)
       (pred_5 obj_02)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_9 obj_01)
       (pred_9 obj_16)

       (pred_11 obj_07 obj_15)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_12 obj_08)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_14 obj_17)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_12)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_18 obj_17)
       (pred_11 obj_18 obj_15)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_14)
       (pred_11 obj_17 obj_18)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_06 obj_02)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_10)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_3  obj_14 obj_13)
       (pred_3  obj_15 obj_19)
       (pred_10 obj_07)
       (pred_10 obj_20)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_18)
       (pred_10 obj_17)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_04)

       (pred_6  obj_01 obj_13)
       (pred_6  obj_16 obj_19)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_16 obj_02)
       (pred_4 obj_07)
    )

    (:goal (and
       (pred_12 obj_16 obj_06)
    ))
(:constraints
  (always (not (pred_4 obj_03)))
)
)

; plan
1. (op_3 obj_07 obj_20)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_12)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_12)
   goals met: 0 of 1
3. (op_3 obj_12 obj_08)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_08)
   goals met: 0 of 1
4. (op_3 obj_08 obj_05)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_05)
   goals met: 0 of 1
5. (op_3 obj_05 obj_09)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_09)
   goals met: 0 of 1
6. (op_3 obj_09 obj_04)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_04)
   goals met: 0 of 1
7. (op_3 obj_04 obj_10)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_02)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_02)
   goals met: 0 of 1
9. (op_1 obj_02 obj_16)
   deleted: (pred_12 obj_16 obj_02) (pred_2)
   added: (pred_1 obj_16)
   goals met: 0 of 1
10. (op_3 obj_02 obj_06)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_06)
   goals met: 0 of 1
11. (op_4 obj_06 obj_16)
   deleted: (pred_1 obj_16)
   added: (pred_2) (pred_12 obj_16 obj_06)
   goals met: 1 of 1
